use spices;
-- 1. Дивимося на ціну "ДО"
SELECT * FROM `spice` WHERE `id` = 1;

-- 2. Починаємо транзакцію
START TRANSACTION;

-- 3. Виконуємо нашу DML-операцію (яку ми хочемо скасувати)
UPDATE `spice`
SET `price` = 999.00 -- Встановлюємо якусь божевільну ціну
WHERE `id` = 1;

-- 4. Переконуємося, що ЦІНА ЗМІНИЛАСЯ (тільки для нас, всередині транзакції)
SELECT * FROM `spice` WHERE `id` = 1;

-- 5. Завершуємо транзакцію ТА СКАСОВУЄМО ВСІ ЗМІНИ
ROLLBACK;

-- 6. Дивимося на ціну "ПІСЛЯ"
SELECT * FROM `spice` WHERE `id` = 1;
